# IMDB MySQL Database Part One
* James Belk
* 3/22/2023

## Imports

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

## Load Data

In [2]:
# basics_url = 'https://datasets.imdbws.com/title.basics.tsv.gz'
# akas_url = 'https://datasets.imdbws.com/title.akas.tsv.gz'
# ratings_url = 'https://datasets.imdbws.com/title.ratings.tsv.gz'

In [3]:
basics = pd.read_csv('Data/title_basics.csv.gz', low_memory = False)

In [4]:
akas = pd.read_csv('Data/title_akas.csv.gz', low_memory=False)

In [5]:
ratings = pd.read_csv('Data/title_ratings.csv.gz', low_memory=False)

### Save Datasets to 'Data' Folder

In [6]:
basics.to_csv('Data/title_basics.csv.gz',compression='gzip',index=False)

In [7]:
akas.to_csv('Data/title_akas.csv.gz', compression='gzip', index = False)

In [8]:
ratings.to_csv('Data/title_ratings.csv.gz', compression='gzip', index = False)

# Clean Data

## Title Basics

In [9]:
display(basics.head())
display(basics.info())

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892.0,NaN,5,"Animation,Short"
1,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893.0,NaN,1,"Comedy,Short"
2,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894.0,NaN,1,Short
3,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894.0,NaN,1,"Short,Sport"
4,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894.0,NaN,45,Romance

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 714643 entries, 0 to 714642
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          714643 non-null  object
 1   titleType       714643 non-null  object
 2   primaryTitle    714643 non-null  object
 3   originalTitle   714643 non-null  object
 4   isAdult         714643 non-null  int64
 5   startYear       707871 non-null  float64
 6   endYear         17538 non-null   float64
 7   runtimeMinutes  714643 non-null  int64
 8   genres          714643 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 49.1+ MB

None

### Replace '\N'

In [10]:
basics = basics.replace({'\\N': np.nan})
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892.0,NaN,5,"Animation,Short"
1,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893.0,NaN,1,"Comedy,Short"
2,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894.0,NaN,1,Short
3,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894.0,NaN,1,"Short,Sport"
4,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894.0,NaN,45,Romance

### Eliminate Movies That Are Null For 'runtimeMinutes'

In [11]:
runtime_drop = basics.dropna(subset=['runtimeMinutes'], inplace = True)

### Eliminate Movies That Are Null For Genre

In [12]:
genre_null = basics.dropna(subset=['genres'], inplace = True)

### Keep Only 'titleType' Movie

In [13]:
movie_type = basics['titleType']=='movie'
basics = basics.loc[movie_type,:]
basics['titleType'].value_counts(dropna = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
4,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894.0,NaN,45,Romance
105,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906.0,NaN,70,"Action,Adventure,Biography"
111,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907.0,NaN,90,Drama
143,tt0000679,movie,The Fairylogue and Radio-Plays,The Fairylogue and Radio-Plays,0,1908.0,NaN,120,"Adventure,Fantasy"
411,tt0001285,movie,The Life of Moses,The Life of Moses,0,1909.0,NaN,50,"Biography,Drama,Family"

### Keep 'startYear' 2000-2002

In [14]:
date_range = (basics['startYear']>=2000)&(basics['startYear']<2002)
basics = basics.loc[date_range,:]
basics.head()
#basics['startYear'].value_counts(dropna=False)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
21232,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
62320,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance"
62354,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama"
62975,tt0114447,movie,The Silent Force,The Silent Force,0,2001.0,NaN,90,Action
63615,tt0115937,movie,Consequence,Consequence,0,2000.0,NaN,91,Drama

### Eliminate Movies That Include 'Documentary' in Genre

In [15]:
is_documentary = basics['genres'].str.contains('documentary', case = False)
basics = basics[~is_documentary]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
21232,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
62320,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance"
62354,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama"
62975,tt0114447,movie,The Silent Force,The Silent Force,0,2001.0,NaN,90,Action
63615,tt0115937,movie,Consequence,Consequence,0,2000.0,NaN,91,Drama
...,...,...,...,...,...,...,...,...,...
701472,tt9212730,movie,Yakuza Zombie,Zonbi gokudo,0,2001.0,NaN,87,"Horror,Thriller"
701839,tt9228234,movie,The Narc Enigma,The Narc Enigma,0,2001.0,NaN,93,Action
705657,tt9412476,movie,Contratiempo Mortal,Contratiempo Mortal,0,2000.0,NaN,90,Action
707918,tt9555974,movie,Haunted School,Gui xue xiao,0,2001.0,NaN,85,Horror
708403,tt9578462,movie,Crying Sky,Ku qi de tian kong,0,2001.0,NaN,85,Drama

### Keep Only US Movies

In [16]:
basics = basics.loc[movie_type, ]

In [17]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2994 entries, 21232 to 708403
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          2994 non-null   object
 1   titleType       2994 non-null   object
 2   primaryTitle    2994 non-null   object
 3   originalTitle   2994 non-null   object
 4   isAdult         2994 non-null   int64
 5   startYear       2994 non-null   float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  2994 non-null   int64
 8   genres          2994 non-null   object
dtypes: float64(2), int64(2), object(5)
memory usage: 233.9+ KB

## AKAs

In [18]:
display(akas.head())
akas.info()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1424064 entries, 0 to 1424063
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1424064 non-null  object
 1   ordering         1424064 non-null  int64
 2   title            1424064 non-null  object
 3   region           1424064 non-null  object
 4   language         3866 non-null     object
 5   types            976227 non-null   object
 6   attributes       46241 non-null    object
 7   isOriginalTitle  1422719 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 86.9+ MB

In [19]:
akas['region'].isin(['US']).any()

True

In [20]:
usa_filter = akas['region']=='US'
akas = akas.loc[usa_filter, :]
akas['region'].value_counts(dropna = False)

US    1424064
Name: region, dtype: int64

In [21]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [22]:
akas = akas.replace({'\\N': np.nan})
akas

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0
...,...,...,...,...,...,...,...,...
1424059,tt9916560,1,March of Dimes Presents: Once Upon a Dime,US,NaN,imdbDisplay,NaN,0.0
1424060,tt9916620,1,The Copeland Case,US,NaN,imdbDisplay,NaN,0.0
1424061,tt9916702,1,Loving London: The Playground,US,NaN,NaN,NaN,0.0
1424062,tt9916756,1,Pretty Pretty Black Girl,US,NaN,imdbDisplay,NaN,0.0
1424063,tt9916764,1,38,US,NaN,imdbDisplay,NaN,0.0

In [23]:
akas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1424064 entries, 0 to 1424063
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1424064 non-null  object
 1   ordering         1424064 non-null  int64
 2   title            1424064 non-null  object
 3   region           1424064 non-null  object
 4   language         3866 non-null     object
 5   types            976227 non-null   object
 6   attributes       46241 non-null    object
 7   isOriginalTitle  1422719 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 97.8+ MB

## Ratings

In [24]:
display(ratings.head())
ratings.info()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1961
1  tt0000002            5.8       263
2  tt0000005            6.2      2600
3  tt0000006            5.1       178
4  tt0000007            5.4       817

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 492984 entries, 0 to 492983
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         492984 non-null  object
 1   averageRating  492984 non-null  float64
 2   numVotes       492984 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.3+ MB

In [25]:
usa = ratings['tconst'].isin(akas['titleId'])
usa

0         True
1         True
2         True
3         True
4         True
          ...
492979    True
492980    True
492981    True
492982    True
492983    True
Name: tconst, Length: 492984, dtype: bool

In [26]:
ratings = ratings[usa].value_counts(dropna = False)
ratings

tconst      averageRating  numVotes
tt0000001   5.7            1961        1
tt18291774  5.8            21          1
tt1830316   7.8            15          1
tt1830312   8.4            77          1
tt1830307   8.2            16          1
                                      ..
tt0588607   8.2            32          1
tt0588606   8.3            34          1
tt0588605   8.2            31          1
tt0588604   8.0            44          1
tt9916428   3.8            14          1
Length: 492984, dtype: int64

In [27]:
ratings = ratings.replace({'\\N': np.nan})
ratings

tconst      averageRating  numVotes
tt0000001   5.7            1961        1
tt18291774  5.8            21          1
tt1830316   7.8            15          1
tt1830312   8.4            77          1
tt1830307   8.2            16          1
                                      ..
tt0588607   8.2            32          1
tt0588606   8.3            34          1
tt0588605   8.2            31          1
tt0588604   8.0            44          1
tt9916428   3.8            14          1
Length: 492984, dtype: int64

In [28]:
ratings.info()

<class 'pandas.core.series.Series'>
MultiIndex: 492984 entries, ('tt0000001', 5.7, 1961) to ('tt9916428', 3.8, 14)
Series name: None
Non-Null Count   Dtype
--------------   -----
492984 non-null  int64
dtypes: int64(1)
memory usage: 27.1+ MB

In [29]:
keepers = basics['tconst'].isin(akas['titleId'])
keepers

21232     True
62320     True
62354     True
62975     True
63615     True
          ...
701472    True
701839    True
705657    True
707918    True
708403    True
Name: tconst, Length: 2994, dtype: bool

In [30]:
basics = basics[keepers]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
21232,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
62320,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance"
62354,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama"
62975,tt0114447,movie,The Silent Force,The Silent Force,0,2001.0,NaN,90,Action
63615,tt0115937,movie,Consequence,Consequence,0,2000.0,NaN,91,Drama
...,...,...,...,...,...,...,...,...,...
701472,tt9212730,movie,Yakuza Zombie,Zonbi gokudo,0,2001.0,NaN,87,"Horror,Thriller"
701839,tt9228234,movie,The Narc Enigma,The Narc Enigma,0,2001.0,NaN,93,Action
705657,tt9412476,movie,Contratiempo Mortal,Contratiempo Mortal,0,2000.0,NaN,90,Action
707918,tt9555974,movie,Haunted School,Gui xue xiao,0,2001.0,NaN,85,Horror
708403,tt9578462,movie,Crying Sky,Ku qi de tian kong,0,2001.0,NaN,85,Drama

# Compressed Files

In [31]:
final_basics = basics.to_csv(f'Data/final_basics.csv.gz', compression='gzip', index=False)
final_akas = akas.to_csv(f'Data/final_akas.csv.gz', compression='gzip', index=False)
final_ratings = ratings.to_csv(f'Data/final_ratings.csv.gz', compression='gzip', index=False)